##### Pandas library
- The name is derived from the term "panel data"

In [1]:
# Load the Pandas library
# Method-1
import pandas

# Method-2
from pandas import *

# Method-3: import with an alias
import pandas as pd

##### Introduction to pandas Data Structures
   - Series & DataFrame

##### Series: 
- Series are very similar to NumPy arrays. The difference is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. We can convert a list,numpy array, or dictionary to a Series.

In [8]:
# Defining & Exploring Pandas Series  
obj = pd.Series([4, 7, -5, 3])
print("Series elemnts and datatype is:\n", obj)
print("\nThe Numpy array elements and its Length and datatype are:", obj.array)
print("\n",obj.index)

Series elemnts and datatype is:
 0    4
1    7
2   -5
3    3
dtype: int64

The Numpy array elements and its Length and datatype are: <NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

 RangeIndex(start=0, stop=4, step=1)

In [10]:
# Define the Series with Index by the label
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
# Accessing the element from the series using index
print(obj2["a"]) # try [[]] this and see the difference
print()
print(obj2[["c", "a", "d"]])

-5

c    3
a   -5
d    4
dtype: int64

In [16]:
# Convert the Dictionary into Pandas series
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
print(type(sdata))
obj3 = pd.Series(sdata)
print(type(obj3))
obj3

<class 'dict'>
<class 'pandas.core.series.Series'>

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
obj3[["Ohio"]]

Ohio    35000
dtype: int64

##### **Reindexing**: It means to create a new object with the values rearranged to align with the new index.

In [18]:
# Creating a series with index
obj4 = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
print("Before reindexing the series is:\n",obj4)

# Reindexing the series
obj5 = obj4.reindex(["a", "b", "c", "d", "e"])
print("After reindexing the series is:\n",obj5)

Before reindexing the series is:
 d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64
After reindexing the series is:
 a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

##### DataFrame: 
- A DataFrame represents a rectangular table of data and contains an ordered, named collection of columns, each of which can be a different value type (numeric, string, Boolean, etc.).

In [2]:
# Construct a DataFrame (Common Method is using dictionary)
data = {"city": ["Lahore", "Karachi", "Faisalabad", "Sargodha", "Jhang", "Multan"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "population": [5.7, 6.7, 3.6, 2.4, 2.1, 3.2]}
print(type(data))
df = pd.DataFrame(data)
print(type(df))
print(df)

<class 'dict'>
<class 'pandas.core.frame.DataFrame'>
         city  year  population
0      Lahore  2000         5.7
1     Karachi  2001         6.7
2  Faisalabad  2002         3.6
3    Sargodha  2001         2.4
4       Jhang  2002         2.1
5      Multan  2003         3.2

In [20]:
# Gives information about the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   city        6 non-null      object
 1   year        6 non-null      int64
 2   population  6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 276.0+ bytes

##### **head() & tail() Methods:** For large DataFrames, the head method selects only the first five rows and tail returns the last five rows

In [111]:
df.head()
# df.head(2)

         city  year  population
0      Lahore  2000         5.7
1     Karachi  2001         6.7
2  Faisalabad  2002         3.6
3    Sargodha  2001         2.4
4       Jhang  2002         2.1

In [112]:
df.tail()

         city  year  population
1     Karachi  2001         6.7
2  Faisalabad  2002         3.6
3    Sargodha  2001         2.4
4       Jhang  2002         2.1
5      Multan  2003         3.2

##### Arrange the DataFrame by specifying a sequence of columns

In [113]:
pd.DataFrame(data, columns=["year", "city", "population"])

   year        city  population
0  2000      Lahore         5.7
1  2001     Karachi         6.7
2  2002  Faisalabad         3.6
3  2001    Sargodha         2.4
4  2002       Jhang         2.1
5  2003      Multan         3.2

##### Access the specific column(s) & Row(s) of the data

In [114]:
df # Complete Data frame

         city  year  population
0      Lahore  2000         5.7
1     Karachi  2001         6.7
2  Faisalabad  2002         3.6
3    Sargodha  2001         2.4
4       Jhang  2002         2.1
5      Multan  2003         3.2

In [115]:
# Access the single column
df.city # Method-1
# df["city"] # Method-2

0        Lahore
1       Karachi
2    Faisalabad
3      Sargodha
4         Jhang
5        Multan
Name: city, dtype: object

In [116]:
# Access the multiple columns 
df[["city","year"]]

         city  year
0      Lahore  2000
1     Karachi  2001
2  Faisalabad  2002
3    Sargodha  2001
4       Jhang  2002
5      Multan  2003

##### loc & iloc attributes used to slice a data set
 -  loc is primarily used for label indexing. 
 -  while iloc is mainly used for integer indexing

In [9]:
df # Complete Data frame

         city  year  population
0      Lahore  2000         5.7
1     Karachi  2001         6.7
2  Faisalabad  2002         3.6
3    Sargodha  2001         2.4
4       Jhang  2002         2.1
5      Multan  2003         3.2

In [10]:
# Access the 3rd row data
df.loc[2] # Method-1 using loc (label of the 3rd row is 2)
# df.iloc[2] # Method-2 using iloc (index of the 3rd row is 2)

city          Faisalabad
year                2002
population           3.6
Name: 2, dtype: object

In [119]:
# select the first and third columns
df.iloc[:, [0, 2]] # use iloc

         city  population
0      Lahore         5.7
1     Karachi         6.7
2  Faisalabad         3.6
3    Sargodha         2.4
4       Jhang         2.1
5      Multan         3.2

In [11]:
df.loc[:, ["city", "population"]] # use loc

         city  population
0      Lahore         5.7
1     Karachi         6.7
2  Faisalabad         3.6
3    Sargodha         2.4
4       Jhang         2.1
5      Multan         3.2

In [5]:
# select the first and third rows, all columns
df.loc[[0, 2],:]

         city  year  population
0      Lahore  2000         5.7
2  Faisalabad  2002         3.6

In [7]:
# select the first 3 rows, all columns
df.loc[0:2,:]

         city  year  population
0      Lahore  2000         5.7
1     Karachi  2001         6.7
2  Faisalabad  2002         3.6

In [13]:
# Select the data entries where city is Lahore or population is greater than 5
df.loc[(df.city=="Lahore") | (df.population > 5)]

      city  year  population
0   Lahore  2000         5.7
1  Karachi  2001         6.7

In [123]:
# Swap rows and columns: Transpose the DataFrame
df.T

                 0        1           2         3      4       5
city        Lahore  Karachi  Faisalabad  Sargodha  Jhang  Multan
year          2000     2001        2002      2001   2002    2003
population     5.7      6.7         3.6       2.4    2.1     3.2

##### Dropping Entries from the data

In [3]:
import numpy as np
obj7 = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
print("Before dropping the data entery: \n", obj7)

new_obj1 = obj7.drop("d") # drop the single entry
print("After dropping the single data entery: \n", new_obj1)

new_obj2 = obj7.drop(["d","e"]) # drop the multiple entries
print("After dropping the multiple data entery: \n", new_obj2)

Before dropping the data entery:
 a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64
After dropping the single data entery:
 a    0.0
b    1.0
c    2.0
e    4.0
dtype: float64
After dropping the multiple data entery:
 a    0.0
b    1.0
c    2.0
dtype: float64

In [152]:
# Creating a data frame
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Python", "C++", "Java", "R-Language"], 
                    columns=["speed", "efficient", "time", "release"])
print("Before dropping the row(s): \n", data)

# Method-1
drop_data = data.drop(index=["R-Language", "C++"]) # drop these rows
# Method-2 (using axis)
# data.drop(["R-Language", "C++"], axis=0) # drop these rows (index=0 mean row, index=1 mean column)
print("After dropping the multiple multiple rows: \n",drop_data)

Before dropping the row(s):
             speed  efficient  time  release
Python          0          1     2        3
C++             4          5     6        7
Java            8          9    10       11
R-Language     12         13    14       15
After dropping the multiple multiple rows:
         speed  efficient  time  release
Python      0          1     2        3
Java        8          9    10       11

In [156]:
# Droping y=the columns

# Method-1
data.drop(columns=["time"])

# Method-2
# data.drop("time", axis=1)

            speed  efficient  release
Python          0          1        3
C++             4          5        7
Java            8          9       11
R-Language     12         13       15

##### Assemble (combing) the data frames

In [162]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"), index=["A", "B", "C"])
print(df1)

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"), index=["D", "A", "B", "E"])
print(df2)

print(df1 + df2)

     b    c    d
A  0.0  1.0  2.0
B  3.0  4.0  5.0
C  6.0  7.0  8.0
     b     d     e
D  0.0   1.0   2.0
A  3.0   4.0   5.0
B  6.0   7.0   8.0
E  9.0  10.0  11.0
     b   c     d   e
A  3.0 NaN   6.0 NaN
B  9.0 NaN  12.0 NaN
C  NaN NaN   NaN NaN
D  NaN NaN   NaN NaN
E  NaN NaN   NaN NaN

##### Function Application and Mapping

In [169]:
# Create a dataframe using random numbers from standard normal distribution 
df = pd.DataFrame(np.random.standard_normal((4, 3)),
                   columns=list("bde"),
                   index=["A", "B", "C", "D"])
df

          b         d         e
A -0.123924  1.033303 -0.524364
B -0.772607 -0.683922  0.141783
C -0.387658  0.557357  0.887799
D  1.695700 -2.499105  1.466826

In [170]:
np.abs(df)

          b         d         e
A  0.123924  1.033303  0.524364
B  0.772607  0.683922  0.141783
C  0.387658  0.557357  0.887799
D  1.695700  2.499105  1.466826

##### DataFrameâ€™s apply() and applymap()
- apply() is used to apply a function along an axis of the DataFrame or on values of Series. 
- applymap() is used to apply a function to a DataFrame elementwise.

In [173]:
# Write a function to find the range of the variable(s)
def rang(x):
    return x.max()- x.min()

# Apply the function on each column of the data frame
df.apply(rang) # Returs column wise range value

b    2.468307
d    3.532408
e    1.991190
dtype: float64

In [179]:
# Write a function that shows numerial values upto three decimals points
def df_format(x):
    return f"{x:.3f}"

df.applymap(df_format)

        b       d       e
A  -0.124   1.033  -0.524
B  -0.773  -0.684   0.142
C  -0.388   0.557   0.888
D   1.696  -2.499   1.467

##### Summarizing and Computing Descriptive Statistics

In [4]:
# Create a dataframe using random numbers from standard normal distribution 
df = pd.DataFrame(np.random.standard_normal((4, 3)),
                   columns=list("bde"),
                   index=["A", "B", "C", "D"])
df

          b         d         e
A -0.397667 -0.739230  0.420633
B  0.332368  0.082009 -1.223888
C -1.035845  0.337333 -0.652221
D  0.066313 -0.211998  0.219766

In [5]:
# Returns the data frame information
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   b       4 non-null      float64
 1   d       4 non-null      float64
 2   e       4 non-null      float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [186]:
print(df.sum()) # Column wise sum (by default)
print(df.sum(axis=1)) # Row wise Sum

b    0.560198
d    0.400379
e    3.657790
dtype: float64
A    1.752141
B   -0.053759
C    1.010979
D    1.909006
dtype: float64

In [188]:
print(df.mean())
print(df.mean(axis="columns"))

b    0.140050
d    0.100095
e    0.914448
dtype: float64
A    0.584047
B   -0.017920
C    0.336993
D    0.636335
dtype: float64

In [189]:
# Cumulative sum
df.cumsum()

          b         d         e
A -0.447605  1.970084  0.229662
B -1.384736  1.207841  1.875277
C -1.287530  1.004190  2.992701
D  0.560198  0.400379  3.657790

In [6]:
# Descriptive statistics
df.describe()

              b         d         e
count  4.000000  4.000000  4.000000
mean  -0.258708 -0.132972 -0.308927
std    0.599516  0.462312  0.767415
min   -1.035845 -0.739230 -1.223888
25%   -0.557211 -0.343806 -0.795138
50%   -0.165677 -0.064994 -0.216227
75%    0.132827  0.145840  0.269983
max    0.332368  0.337333  0.420633

In [7]:
df.describe().transpose()  # or equivalently, df.describe().T

   count      mean       std       min       25%       50%       75%       max
b    4.0 -0.258708  0.599516 -1.035845 -0.557211 -0.165677  0.132827  0.332368
d    4.0 -0.132972  0.462312 -0.739230 -0.343806 -0.064994  0.145840  0.337333
e    4.0 -0.308927  0.767415 -1.223888 -0.795138 -0.216227  0.269983  0.420633

##### Unique Values & Value Counts

In [193]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
obj.unique() # Returns an array of the unique values

array(['c', 'a', 'd', 'b'], dtype=object)

In [194]:
obj.value_counts() # Returns the value frequencies

c    3
a    3
b    2
d    1
dtype: int64